#### DWFExportOptions Members

---

|  |
| --- |
| DWFExportOptions Class   Constructors   Methods   Properties   See Also |

The  DWFExportOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DWFExportOptions | Default constructor. Sets all options to their default values. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CropBoxVisible | Whether to export crop box. |
| Public property | ExportingAreas | Whether to also export areas and rooms' geometry. |
| Public property | ExportObjectData | Whether to include properties associated with elements. |
| Public property | ExportOnlyViewId | Only export the specified view. |
| Public property | ExportTexture | Whether to export texture. |
| Public property | ImageFormat | Controls the compression level of images embedded. |
| Public property | ImageQuality | Image quality level when compressed raster format(JPEG) is used. |
| Public property | MergedViews | Whether to merge all views in one file. |
| Public property | PaperFormat | Standard paper format. |
| Public property | PortraitLayout | Paper orientation - Portrait/Landscape. |
| Public property | StopOnError | Whether export process should stop when a view fails to export. |

# See Also

DWFExportOptions Class

Autodesk.Revit.DB Namespace